pkgs/emacs/config.el
;;; -*- no-byte-compile: t; lexical-binding: t; -*

(setq use-package-always-ensure t)

(setq gc-cons-threshold 100000000) ;; 100 MB

;; Improve performance with language servers.
(setq read-process-output-max (* 1024 1024)) ;; 1 MB

(defvar g/path/elispcfg (expand-file-name "~/.emacs.d/init.el"))
(defvar g/path/orgcfg   (expand-file-name "~/.emacs.d/init.org"))
(defvar g/fheight       (if (eq system-type 'darwin) 150 130))
(defvar g/ffamily       "JetBrainsMono Nerd Font Propo")
(defvar g/opacity/alpha (if (eq system-type 'darwin) 40 80))
(defvar g/opacity/solid 100)
;; default to no transparency
(defvar g/opacity/current  g/opacity/solid)

;; keybinds ;;
(defun helper/mapkeys (leader-map keypairs)
  "map keybinds to a prefixed leader"
  (interactive)
  (dolist (pair keypairs)
    ;; pair format = ("key" . cmd)
    (define-key leader-map (kbd (car pair)) (cdr pair))))

(defun helper/buffer/toggle (cmd)
  (interactive)
  (let* ((buf-name (concat "*" cmd "*"))
         (buf      (get-buffer buf-name)))
    (if buf
        (progn
          (when-let ((win (get-buffer-window buf)))
            (delete-window win))
          (kill-buffer buf))
      (call-interactively (intern cmd)))))

;; program(s)
(defun helper/open-split-term ()
  (interactive)
  (let* ((height (floor (* 0.25 (window-total-height))))
         (new-win (split-window-below (- height))))
    (select-window new-win)
    (vterm (getenv "SHELL"))))

;; opacity
(defun helper/opacity/set (opacity)
  (set-frame-parameter (selected-frame) 'alpha-background opacity)
  (add-to-list 'default-frame-alist `(alpha-background . ,opacity))

  ;; must manually set corfu frame-opacity
  (with-eval-after-load 'corfu
    (setq corfu-prefer-childframe t)
    (setq corfu-childframe-frame-parameters
          '((alpha-background . ,(+ opacity 10))
            (internal-border-width . 1)
            (left-fringe . 5)
            (right-fringe . 5)))))

(defun helper/opacity/toggle ()
  (interactive)
  (setq g/opacity/current
        (if (= g/opacity/current g/opacity/solid)
            g/opacity/alpha
          g/opacity/solid))
  (helper/opacity/set g/opacity/current))

;; theme ;;
(defun doom/colors (color)
  (cadr (assoc color doom-themes--colors)))

(use-package emacs
  :custom
  ;; ui
  (menu-bar-mode nil)         ;; Disable the menu bar
  (scroll-bar-mode nil)       ;; Disable the scroll bar
  (tool-bar-mode nil)         ;; Disable the tool bar

  ;; all the inhitibits
  (inhibit-splash-screen t)
  (inhibit-startup-screen t)
  (inhibit-startup-message t)
  (inhibit-startup-buffer-menu t)

  (blink-cursor-mode nil)     ;; Don't blink cursor

  ;; selection
  (use-short-answers t)       ;; Use y/n instead of yes/no
  (delete-selection-mode t)   ;; Select text and delete it by typing.
  (vc-follow-symlinks nil)    ;; follow git-symlink without prompt

  ;; behavior
  (electric-indent-mode nil)  ;; Turn off the weird indenting that Emacs does by default.
  (indent-tabs-mode nil) ;; use spaces instead of tabs
  (tab-width 4)

  (global-auto-revert-mode t) ;; Automatically reload file and show changes if the file has changed

  (recentf-mode t) ;; Enable recent file mode

  ;; scrolling
  (mouse-wheel-progressive-speed nil) ;; Disable progressive speed when scrolling
  (scroll-conservatively 10) ;; Smooth scrolling
  (scroll-margin 8)

  ;; history
  (savehist-mode) ;; Enables save history mode
  (make-backup-files nil) ;; Stop creating ~ backup files
  (auto-save-default nil) ;; Stop creating # auto save files

  :hook
  (before-save   . delete-trailing-whitespace)
  (prog-mode     . (lambda () (display-line-numbers-mode 1)))
  :config
  ;; Move customization variables to a separate file and load it, avoid filling up init.el with unnecessary variables
  (setq custom-file (locate-user-emacs-file "custom-vars.el"))
  :bind (
         ([escape] . keyboard-escape-quit) ;; Makes Escape quit prompts (Minibuffer Escape)
         ;; Zooming In/Out
         ("C-=" . text-scale-increase)
         ("C--" . text-scale-decrease)
         ("<C-wheel-up>" . text-scale-increase)
         ("<C-wheel-down>" . text-scale-decrease)))
