pkgs/emacs/config.org
** Meow
Note that C-c cmds will also work with space prefix
#+begin_src elisp
    (defun meow-setup ()
      (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
      (setq meow-use-clipboard t)
      ;; (meow-motion-define-key '("?" . ?)
      (meow-leader-define-key '("<tab>" . meow-comment))
      ;; (meow-normal-define-key
       ;; vim additions
       ;; ))
    (meow-motion-define-key
     '("k" . meow-next)
     '("j" . meow-prev)
     '("<escape>" . ignore))
    (meow-leader-define-key
     ;; Use SPC (0-9) for digit arguments.
     '("1" . meow-digit-argument)
     '("2" . meow-digit-argument)
     '("3" . meow-digit-argument)
     '("4" . meow-digit-argument)
     '("5" . meow-digit-argument)
     '("6" . meow-digit-argument)
     '("7" . meow-digit-argument)
     '("8" . meow-digit-argument)
     '("9" . meow-digit-argument)
     '("0" . meow-digit-argument)
     '("/" . meow-keypad-describe-key)
     '("?" . meow-cheatsheet))
    (meow-normal-define-key
     '("0" . meow-expand-0)
     '("9" . meow-expand-9)
     '("8" . meow-expand-8)
     '("7" . meow-expand-7)
     '("6" . meow-expand-6)
     '("5" . meow-expand-5)
     '("4" . meow-expand-4)
     '("3" . meow-expand-3)
     '("2" . meow-expand-2)
     '("1" . meow-expand-1)
     '("-" . negative-argument)
     '(";" . meow-reverse)
     '("," . meow-inner-of-thing)
     '("." . meow-bounds-of-thing)
     '("[" . meow-beginning-of-thing)
     '("]" . meow-end-of-thing)
     '("a" . meow-append)
     '("A" . meow-open-below)
     '("b" . meow-back-word)
     '("B" . meow-back-symbol)
     '("c" . meow-change)
     '("d" . meow-delete)
     '("D" . meow-backward-delete)
     '("e" . meow-next-word)
     '("E" . meow-next-symbol)
     '("f" . meow-find)
     '("G" . meow-grab)
     '("h" . meow-left)
     '("H" . meow-left-expand)
     '("i" . meow-insert)
     '("I" . meow-open-above)
     '("j" . meow-next)
     '("J" . meow-next-expand)
     '("k" . meow-prev)
     '("K" . meow-prev-expand)
     '("l" . meow-right)
     '("L" . meow-right-expand)
     '("m" . meow-join)
     '("n" . meow-search)
     '("o" . meow-block)
     '("O" . meow-to-block)
     '("p" . meow-yank)
     '("q" . meow-quit)
     '("Q" . meow-goto-line)
     '("r" . meow-replace)
     '("R" . meow-swap-grab)
     '("s" . meow-kill)
     '("t" . meow-till)
     '("u" . meow-undo)
     '("U" . meow-undo-in-selection)
     '("v" . meow-visit)
     '("w" . meow-mark-word)
     '("W" . meow-mark-symbol)
     '("x" . meow-line)
     '("X" . meow-goto-line)
     '("y" . meow-save)
     '("Y" . meow-sync-grab)
     '("z" . meow-pop-selection)
     '("'" . repeat)
     '("<escape>" . ignore)
     ;; my additons
     '("%" . end-of-line)
     '("$" . beginning-of-line)
     '(":" . meow-M-x)
     '("`" . meow-cancel)

  ))

    (use-package meow)
    (meow-setup)
    (meow-global-mode 1)
#+end_src
** Keybinds
*** C-x
- note C-b originally bound to buffer-list (because ibuffer is better)
#+begin_src elisp
  (helper/mapkeys ctl-x-map
                  '(("C-r"        . (lambda () (interactive) (load-file g/path/elispcfg)))
                    ("C-<return>" . helper/open-split-term)
                    ("C-b"        . ibuffer)))
#+end_src
*** lsp
#+begin_src elisp
  (defvar emap/lsp (make-sparse-keymap))
  (global-set-key (kbd "C-c l") emap/lsp)

  (helper/mapkeys emap/lsp
                  '(("f" . eglot-format-buffer)
                    ("r" . eglot-rename)
                    ("i" . imenu)))
#+end_src
*** toggle
#+begin_src elisp
  (defvar emap/toggle (make-sparse-keymap))
  (global-set-key (kbd "C-c t") emap/toggle)

  (helper/mapkeys emap/toggle
                  '(("b" . global-tab-line-mode)
                    ("n" . display-line-numbers-mode)
                    ("N" . global-display-line-numbers-mode)
                    ("o" . helper/opacity/toggle)
                    ("w" . visual-wrap-prefix-mode)
                    ("W" . global-visual-wrap-prefix-mode)))
#+end_src

-----

* Programs
** Dired
#+begin_src elisp
  (use-package dired
    :ensure nil ;; builtin
    :custom
    (dired-omit-files "^\\..*$") ;; hide . & .. folders
    :config
    (setq
     dired-listing-switches "-Aloh --group-directories-first"
     delete-by-moving-to-trash t
     ;; Dired don't create new buffer
     dired-kill-when-opening-new-dired-buffer t)
    ;; macos ls is poop, we need better ls
    (when (eq system-type 'darwin)
      (let ((gls (executable-find "gls")))
        (when gls
          (setq dired-use-ls-dired t
                insert-directory-program gls)))))
        #+end_src
*** Dired Hacks - Collapse
#+begin_src elisp
  (use-package dired-collapse
    :hook (dired-mode . global-dired-collapse-mode))
#+end_src
*** Diredfl
+ Additional syntax highlighting for dired
#+begin_src elisp
  (use-package diredfl :hook ((dired-mode . diredfl-mode)))
#+end_src
** Direnv
#+begin_src elisp
  (if (executable-find "direnv") (use-package direnv))
#+end_src
** Vterm
#+begin_src elisp
  (use-package vterm)
#+end_src
** pdf-tools
#+begin_src elisp
  (use-package pdf-tools
    :init (pdf-loader-install))
#+end_src

-----

* Appearance
** Theme
#+begin_src elisp
  (use-package doom-themes
    :custom
    ;; Global settings (defaults)
    (doom-themes-enable-bold t)   ;; if nil, bold is universally disabled
    (doom-themes-enable-italic t) ;; if nil, italics is universally disabled
    :config
    (load-theme 'doom-nord t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))
#+end_src
** Font
#+begin_src elisp
  (set-face-attribute 'default nil
                      :font   g/ffamily
                      :height g/fheight
                      :weight 'medium)
  (setq-default line-spacing 0.12)
#+end_src
** Nerd Font
#+begin_src elisp
  (use-package nerd-icons
    :if (display-graphic-p))

  (use-package nerd-icons-dired
    :hook (dired-mode . nerd-icons-dired-mode))

  (use-package nerd-icons-ibuffer
    :hook (ibuffer-mode . nerd-icons-ibuffer-mode))
#+end_src
** Doom-modeline
#+begin_src elisp
  (use-package doom-modeline
    :custom
    (display-time-24hr-format t)
    (display-time-mode t)
    (doom-modeline-spc-face-overrides nil)
    (doom-modeline-buffer-encoding nil)
    :hook (after-init . doom-modeline-mode))
#+end_src
-----

* Nerd
** Projectile
+ Hmmm, project-ile, maybe has to do with projects?
#+begin_src elisp
  (use-package projectile
    :custom
    (projectile-indexing-method 'alien)
    (projectile-run-use-comint-mode t)
    (projectile-switch-project-action #'projectile-dired)
    (projectile-project-search-path '("~/Documents/" "~/Repos/")))
#+end_src
** Eglot
I love lsp-mode semantic tokens but oh boy, it was
a pain working with c++ files...
#+begin_src elisp
  (use-package eglot
    :ensure nil
    :hook ((c-ts-mode
            c++-ts-mode
            go-mode
            haskell-mode
            java-mode
            lua-mode
            nix-ts-mode
            python-mode
            zig-mode)
           . eglot-ensure)
    :custom
    (eglot-sync-connect 0)  ;; async startup
    (eglot-autoshutdown t) ;; kill server when last buffer closes
    (eglot-events-buffer-size 0) ;; prevent huge debug buffers
    )
#+end_src
** Tree Sitter
Tree, sitting...
#+begin_src elisp
  (use-package treesit-auto
    :after (tree-sitter)
    :custom
    (treesit-auto-install 't)
    :config
    (global-treesit-auto-mode)
    (treesit-auto-add-to-auto-mode-alist 'all))
#+end_src

-----

* Language Modes
Some languages will be wrapped in exec-find, these
are the languages I have installed in my nix config;
mainly because I find they work better installed on
my system vs using a shell.
** Misc Language-Specific Modes
#+begin_src elisp
  ;; config/text
  (use-package just-mode)
  (use-package kdl-mode :mode "\\.kdl\\'")
  (use-package ron-mode :mode "\\.ron\\'")

  ;; scripting/shell
  (use-package fish-mode)
  (use-package gnuplot-mode)
  (use-package lua-mode)
  (use-package nushell-mode)
  (use-package nix-ts-mode :mode "\\.nix\\'")
  (with-eval-after-load 'eglot
    (setq-default
     eglot-workspace-configuration
     '(:nixd
       (:formatting
        (:command ["alejandra"])))))
#+end_src
** Go
#+begin_src elisp
  (use-package go-mode :mode (("\\.go\\'" . go-mode)
                              ("\\go.mod\\'" . go-mode)))
#+end_src
** Rust
#+begin_src elisp
  (use-package rust-mode
    :init
    (setq rust-mode-treesitter-derive t))

  (use-package rustic
    :after (rust-mode)
    :config
    (setq rustic-format-on-save nil)
    (setq rustic-lsp-client 'eglot)
    :custom
    (rustic-cargo-use-last-stored-arguments t))
#+end_src

-----

