pkgs/emacs/config.org
* Org Mode
#+begin_src elisp
  (use-package org
    :custom
    (org-return-follows-link t)   ;; Sets RETURN key in org-mode to follow links
    :config
    (setq org-catch-invisible-edits 'show-and-error
          org-insert-heading-respect-content t
          ;; Org styling, hide markup etc.
          org-hide-emphasis-markers t
          org-pretty-entities t
          org-replace-disputed-keys t
          ;; use [...] for folded text
          org-ellipsis " [...]"))
        #+end_src
+ Facename cheatsheet:
    - org-level-n, /where n is the header level/
    - org-document-{title, info, info-keyword}
    - org-{tag,todo, done, special-keyword, warning, date}
+ Here are some sensible size changes for org-headers and the tile+info parts
#+begin_src elisp
  (set-face-attribute 'org-document-title nil :height 1.3 :weight 'bold)
  (set-face-attribute 'org-document-info nil :height 1.2 :weight 'bold)
  (set-face-attribute 'org-level-1 nil :height 1.2 :weight 'bold)
  (set-face-attribute 'org-level-2 nil :height 1.2 :weight 'bold)
  (set-face-attribute 'org-level-3 nil :height 1.1 :weight 'bold)
#+end_src
** Org Modern
#+begin_src elisp
  (use-package org-modern
    :init (global-org-modern-mode)
    :config
    (setq org-modern-star ["●" "○" "◆" "◇" "▶" "▷"]))
#+end_src
** Org LaTeX Fragment Previews
+ Use dvisvgm for LaTeX fragment previews
#+begin_src elisp
  (setq org-latex-create-formula-image-program 'dvisvgm)
  (setq org-preview-latex-default-process 'dvisvgm)
  (setq org-format-latex-options
      (plist-put org-format-latex-options :scale 1.5))
#+end_src
** Subtle Margins
#+begin_src elisp
  (defun helper/org/set-margins ()
    (let ((margin 2))
      (setq-local left-margin-width margin
                  right-margin-width margin)
      (set-window-buffer nil (current-buffer))))
  (add-hook 'org-mode-hook #'helper/org/set-margins)

  ;; have horizontal rule ignore magrins
  (with-eval-after-load 'org-modern
    (set-face-attribute 'org-modern-horizontal-rule nil :extend t))
#+end_src
-----

* Completion
** Corfu
+ "COmpletion in Region FUnction"
#+begin_src elisp
  (use-package corfu
    :custom
    (corfu-auto nil) ;; no auto-popups
    (corfu-cycle t)  ;; Enable cycling for `corfu-next/previous'
    (text-mode-ispell-word-completion nil)
    :init
    (global-corfu-mode)
    :bind
    (:map corfu-map
          ("<tab>" . corfu-next)
          ("tab" . corfu-next)
          ("<backtab>" . corfu-previous)
          ("RET" . corfu-insert)
          ("<escape>" . corfu-quit)))

  ;; setup for rebinding completion to control+tab instead of tab
  (defun force/corfu-complete ()
    "Force manual trigger for corfu completion at point"
    (interactive)
    (let ((completion-at-point-functions completion-at-point-functions))
      (completion-at-point)))
  (global-set-key (kbd "C-<tab>") #'force/corfu-complete)

  ;; nerd icon support
  (use-package nerd-icons-corfu
    :after corfu
    :init (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+end_src
** Cape
+ Completion extensions
#+begin_src elisp
  (use-package cape
    :after corfu
    :init
    (add-to-list 'completion-at-point-functions #'cape-dabbrev) ;; Complete word from current buffers
    (add-to-list 'completion-at-point-functions #'cape-file) ;; Path completion
    (add-to-list 'completion-at-point-functions #'cape-elisp-block) ;; Complete elisp in Org or Markdown mode
    (add-to-list 'completion-at-point-functions #'cape-keyword) ;; Keyword completion
    (add-to-list 'completion-at-point-functions #'cape-tex) ;; Complete Unicode char from TeX command, e.g. \hbar
    )
#+end_src
** Flycheck
+ Checks your fly...
#+begin_src elisp
  (use-package flycheck
    :hook after-init global-flycheck-mode
    :config
    (setq flycheck-indication-mode nil))
#+end_src
** Vertico and Marginalia
+ "VERTical Interactive COmpletion"
+ "Marginalia in the minibuffer"
+ AKA Completion in minibuffer
#+begin_src elisp
  (use-package vertico
    :init
    (vertico-mode))

  (use-package marginalia
    :after vertico
    :init
    (marginalia-mode))

  ;; more nerd icon support
  (use-package nerd-icons-completion
    :after marginalia
    :config
    (nerd-icons-completion-mode)
    :hook
    ('marginalia-mode-hook . 'nerd-icons-completion-marginalia-setup))
#+end_src
** Orderless
#+begin_src elisp
  (use-package orderless
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles partial-completion))))
    (completion-category-defaults nil) ;; Disable defaults, use our settings
    (completion-pcm-leading-wildcard t) ;; Emacs 31: partial-completion behaves like substring
    )
#+end_src
** Yasnippet
#+begin_src elisp
  (use-package yasnippet
    :config
    (yas-global-mode 1))
#+end_src
Additional pre-made snippets
#+begin_src elisp
  (use-package yasnippet-snippets)
#+end_src
Cape integration with yansnippets
#+begin_src elisp
  (use-package yasnippet-capf
    :after cape
    :config
    (add-to-list 'completion-at-point-functions #'yasnippet-capf))
#+end_src

-----

* Late Load
** Git
*** Magit
#+begin_src elisp
  (use-package magit
    :custom (magit-diff-refine-hunk (quote all)) ;; Shows inline diff
    :config (define-key transient-map (kbd "<escape>") 'transient-quit-one)) ;; Make escape quit magit prompts
#+end_src
*** Diff-hl
#+begin_src elisp
  (use-package diff-hl
    :hook ((dired-mode         . diff-hl-dired-mode-unless-remote)
           (magit-post-refresh . diff-hl-magit-post-refresh))
    :init (global-diff-hl-mode))
#+end_src
** Help!
*** Helpful
#+begin_src elisp
  (use-package helpful
    :bind
    ("C-h f" . helpful-callable)
    ("C-h v" . helpful-variable)
    ("C-h k" . helpful-key)
    ("C-h x" . helpful-command))
#+end_src
*** Which-key
#+begin_src elisp
    (use-package which-key
      :ensure nil ;; Don't install which-key because it's now built-in
      :init
      (which-key-mode 1)
      :diminish
      :custom
      (which-key-side-window-location 'bottom)
      (which-key-sort-order #'which-key-key-order-alpha) ;; Same as default, except single characters are sorted alphabetically
      (which-key-sort-uppercase-first nil)
      (which-key-add-column-padding 1) ;; Number of spaces to add to the left of each column
      (which-key-min-display-lines 6)  ;; Increase the minimum lines to display because the default is only 1
      (which-key-idle-delay 0.8)       ;; Set the time delay (in seconds) for the which-key popup to appear
      (which-key-max-description-length 25)
      (which-key-allow-imprecise-window-fit nil)) ;; Fixes which-key window slipping out in Emacs Daemon
#+end_src
** Rainbows!
*** Rainbow Delimiters
+ colorful brackets
#+begin_src elisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
*** Rainbow Mode
#+begin_src elisp
  (use-package rainbow-mode
    :config (setq rainbow-x-colors nil)
    :hook (prog-mode . rainbow-mode))
#+end_src
** Face overrides
flycheck
#+begin_src elisp

  ;; make flycheck wavy lines not-wavy
  (with-eval-after-load 'flycheck
    (set-face-attribute 'flycheck-error nil
                        :inherit 'error
                        :underline t)
    (set-face-attribute 'flycheck-warning nil
                        :inherit 'warning
                        :underline t)
    (set-face-attribute 'flycheck-info nil
                        :inherit 'success
                        :underline t))
#+end_src
-----

* Darwin fixes
begin darwin only block
#+begin_src elisp
  (when (eq system-type 'darwin)
    (progn
#+end_src
** Exec Path from Shell
+ Allows for MacOS to import PATH to shells
#+begin_src elisp
  (use-package exec-path-from-shell
    :if (memq window-system '(mac ns))
    :config
    (exec-path-from-shell-initialize))
#+end_src
** Ultra Scroll
+ Smooth Scrolling
#+BEGIN_src elisp
    (use-package ultra-scroll
      :init
      (setq scroll-margin 0) ; important: scroll-margin greater than 0 not yet supported
      :config
      (ultra-scroll-mode 1))
#+END_src
end darwin only block
#+begin_src elisp
  ))
#+end_src
